In [1]:
import pandas as pd
studentdata=pd.read_csv('Studentdata.csv')
print(studentdata)

   StudentNumber StudentFName     City  FeePaid($)
0         NE2345        James  Nairobi         400
1         WR4657        Alice  Nairobi         564
2         TY6453        Frida   Kisumu         354
3         RT6576         Anne   Kisumu         456
4         WE6534       Hellen   Nakuru         678
5         YT6998         Joan  Nairobi         432
6         TK7865      Derrick   Kisumu         897
7         RY5643     Beatrice  Mombasa         876
8         GH4563        Grace  Mombasa         457
9         RT8976       Reagan   Nakuru         997
10        LK4356       Benard  Mombasa         298
11        PP5643      Maurice  Nairobi         986
12        TB7894       Juliet  Nairobi         675
13        YS3455         Noel   Kisumu         745
14        QW4334      Leonard  Nairobi         908
15        LQ3776      Vincent   Kisumu         786

In [2]:
studentdata

   StudentNumber StudentFName     City  FeePaid($)
0         NE2345        James  Nairobi         400
1         WR4657        Alice  Nairobi         564
2         TY6453        Frida   Kisumu         354
3         RT6576         Anne   Kisumu         456
4         WE6534       Hellen   Nakuru         678
5         YT6998         Joan  Nairobi         432
6         TK7865      Derrick   Kisumu         897
7         RY5643     Beatrice  Mombasa         876
8         GH4563        Grace  Mombasa         457
9         RT8976       Reagan   Nakuru         997
10        LK4356       Benard  Mombasa         298
11        PP5643      Maurice  Nairobi         986
12        TB7894       Juliet  Nairobi         675
13        YS3455         Noel   Kisumu         745
14        QW4334      Leonard  Nairobi         908
15        LQ3776      Vincent   Kisumu         786

In [3]:
print(studentdata.head())

  StudentNumber StudentFName     City  FeePaid($)
0        NE2345        James  Nairobi         400
1        WR4657        Alice  Nairobi         564
2        TY6453        Frida   Kisumu         354
3        RT6576         Anne   Kisumu         456
4        WE6534       Hellen   Nakuru         678

In [4]:
print(studentdata.head(6))

  StudentNumber StudentFName     City  FeePaid($)
0        NE2345        James  Nairobi         400
1        WR4657        Alice  Nairobi         564
2        TY6453        Frida   Kisumu         354
3        RT6576         Anne   Kisumu         456
4        WE6534       Hellen   Nakuru         678
5        YT6998         Joan  Nairobi         432

In [6]:
print(studentdata.tail())

   StudentNumber StudentFName     City  FeePaid($)
11        PP5643      Maurice  Nairobi         986
12        TB7894       Juliet  Nairobi         675
13        YS3455         Noel   Kisumu         745
14        QW4334      Leonard  Nairobi         908
15        LQ3776      Vincent   Kisumu         786

In [7]:
print (studentdata.tail(7))

   StudentNumber StudentFName     City  FeePaid($)
9         RT8976       Reagan   Nakuru         997
10        LK4356       Benard  Mombasa         298
11        PP5643      Maurice  Nairobi         986
12        TB7894       Juliet  Nairobi         675
13        YS3455         Noel   Kisumu         745
14        QW4334      Leonard  Nairobi         908
15        LQ3776      Vincent   Kisumu         786

In [8]:
studentdata.tail(6)

   StudentNumber StudentFName     City  FeePaid($)
10        LK4356       Benard  Mombasa         298
11        PP5643      Maurice  Nairobi         986
12        TB7894       Juliet  Nairobi         675
13        YS3455         Noel   Kisumu         745
14        QW4334      Leonard  Nairobi         908
15        LQ3776      Vincent   Kisumu         786

In [2]:
print(studentdata.info())

NameError: name 'studentdata' is not defined

In [11]:
 print(studentdata.sample())

  StudentNumber StudentFName    City  FeePaid($)
4        WE6534       Hellen  Nakuru         678

In [12]:
studentdata.sample(6)

   StudentNumber StudentFName     City  FeePaid($)
15        LQ3776      Vincent   Kisumu         786
12        TB7894       Juliet  Nairobi         675
4         WE6534       Hellen   Nakuru         678
11        PP5643      Maurice  Nairobi         986
8         GH4563        Grace  Mombasa         457
10        LK4356       Benard  Mombasa         298

In [1]:
#Example 2
import pandas as pd
sales=pd.read_csv('sales.csv')
print(sales)

  Product Region  Sales
0  Laptop  North  15000
1  Laptop  South  18000
2  Tablet  North   9000
3  Tablet  South  12000
4  Laptop  North  16000

In [11]:
sales.sample()

  Product Region  Sales
2  Tablet  North   9000

In [12]:
sales.tail(5)

  Product Region  Sales
0  Laptop  North  15000
1  Laptop  South  18000
2  Tablet  North   9000
3  Tablet  South  12000
4  Laptop  North  16000

In [14]:
sales.head(5)

  Product Region  Sales
0  Laptop  North  15000
1  Laptop  South  18000
2  Tablet  North   9000
3  Tablet  South  12000
4  Laptop  North  16000

In [16]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Product  5 non-null      object
 1   Region   5 non-null      object
 2   Sales    5 non-null      int64
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [23]:
   grouped = sales.groupby('Product')['Sales'].sum()
   print(grouped)

Product
Laptop    49000
Tablet    21000
Name: Sales, dtype: int64

In [25]:
grouped_both = sales.groupby(['Product', 'Region'])['Sales'].sum()
print(grouped_both)

Product  Region
Laptop   North     31000
         South     18000
Tablet   North      9000
         South     12000
Name: Sales, dtype: int64

In [26]:
grouped = sales.groupby('Region')['Sales'].sum()
print(grouped)

Region
North    40000
South    30000
Name: Sales, dtype: int64